# Pandas Advance-1

Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
School = pd.DataFrame({
    'Name':['A','B','C','D','E','F','G'],
    'Class':[5,7,3,8,5,11,12],
    'City':['del','blr','ggn','hyd','kol','hyd','ggn']
})

In [4]:
School

  Name  Class City
0    A      5  del
1    B      7  blr
2    C      3  ggn
3    D      8  hyd
4    E      5  kol
5    F     11  hyd
6    G     12  ggn

In [11]:
# Function1: Head
School.head(3)

  Name  Class City
0    A      5  del
1    B      7  blr
2    C      3  ggn

In [12]:
# Function2: Tail
School.tail(2)

  Name  Class City
5    F     11  hyd
6    G     12  ggn

In [13]:
# Function3: Describe
School.describe()

           Class
count   7.000000
mean    7.285714
std     3.302236
min     3.000000
25%     5.000000
50%     7.000000
75%     9.500000
max    12.000000

In [20]:
# Function4: value_counts
School.value_counts()

Name  Class  City
A     5      del     1
B     7      blr     1
C     3      ggn     1
D     8      hyd     1
E     5      kol     1
F     11     hyd     1
G     12     ggn     1
dtype: int64

In [22]:
# Function5: read_csv
pd.read_excel('sales_data.xlsx')

    Unnamed: 0       Date  Random_Value
0            0 2024-01-01            30
1            1 2024-01-02            14
2            2 2024-01-03            16
3            3 2024-01-04            32
4            4 2024-01-05            25
..         ...        ...           ...
95          95 2024-04-05            15
96          96 2024-04-06            27
97          97 2024-04-07            23
98          98 2024-04-08            32
99          99 2024-04-09            25

[100 rows x 3 columns]

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [26]:
df = pd.DataFrame({
    'A':[1,2,3,4,6],
     'B':[4,7,8,3,2],
     'C':[5,9,2,1,5]
})

In [27]:
df

   A  B  C
0  1  4  5
1  2  7  9
2  3  8  2
3  4  3  1
4  6  2  5

In [33]:
def reindex_df(df):
    new_index = pd.Series(range(1, len(df) * 2, 2))  # Generate index from 1 and then increment by 2
    return df.reset_index(drop=True).set_index(new_index)

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [37]:
DF = pd.DataFrame({
    'Values':[1,2,3,4,6],
     'data':[4,7,8,3,2]
})

In [38]:
DF

   Values  data
0       1     4
1       2     7
2       3     8
3       4     3
4       6     2

In [50]:
def collect():
    total = DF['Values'].iloc[:3].sum()
    return total

In [51]:
collect()

6

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [53]:
stamp = pd.DataFrame({
    'Text':['hello how are you','today i will perform assignments','i will upload it to github','enjoy learning python']
})

In [54]:
stamp

                               Text
0                 hello how are you
1  today i will perform assignments
2        i will upload it to github
3             enjoy learning python

In [62]:
stamp['Word_count'] = stamp['Text'].apply(lambda x: len(x.split()))

In [63]:
stamp

                               Text  Word_count
0                 hello how are you           4
1  today i will perform assignments           5
2        i will upload it to github           6
3             enjoy learning python           3

Q5. How are DataFrame.size() and DataFrame.shape() different?

Shape tell us the number of row and column (m x n) present in the dataframe while, size tells us the total number of elements present in the dataframe.

Q6. Which function of pandas do we use to read an excel file?

pd.read_excel('file_name.xlsx')

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [67]:
College = pd.DataFrame({
    'Name':['Jacob','William','Stokes','Bryan'],
    'Email':['jacob.still@xyz.com','will.danes@xyz.com','stokes@xyz.com','bry.antoni@xyz.com']
})

In [68]:
College

      Name                Email
0    Jacob  jacob.still@xyz.com
1  William   will.danes@xyz.com
2   Stokes       stokes@xyz.com
3    Bryan   bry.antoni@xyz.com

In [69]:
def username(College):
    College['Name_only'] = College['Email'].str.split('@').str.get(0)
    return College

In [72]:
username(College)

      Name                Email    Name_only
0    Jacob  jacob.still@xyz.com  jacob.still
1  William   will.danes@xyz.com   will.danes
2   Stokes       stokes@xyz.com       stokes
3    Bryan   bry.antoni@xyz.com   bry.antoni

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [73]:
Stocks = pd.DataFrame({
    'A':[1,2,3,4,6],
     'B':[4,7,8,3,2],
     'C':[5,9,2,1,5]
})

In [74]:
Stocks

   A  B  C
0  1  4  5
1  2  7  9
2  3  8  2
3  4  3  1
4  6  2  5

In [79]:
X1 = Stocks[Stocks['A']>5]

In [81]:
X1

   A  B  C
4  6  2  5

In [80]:
X2 = Stocks[Stocks['B']<10]

In [82]:
X2

   A  B  C
0  1  4  5
1  2  7  9
2  3  8  2
3  4  3  1
4  6  2  5

In [85]:
def show_df(Stocks):
    new = pd.concat([X1,X2],axis=0)
    return new

In [86]:
show_df(Stocks)

   A  B  C
4  6  2  5
0  1  4  5
1  2  7  9
2  3  8  2
3  4  3  1
4  6  2  5

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [89]:
Sales = pd.DataFrame({
    'A':[1,2,3,4,6],
     'B':[4,7,8,3,2],
     'Values':[5,9,2,1,5]
})

In [92]:
Sales

   A  B  Values
0  1  4       5
1  2  7       9
2  3  8       2
3  4  3       1
4  6  2       5

In [93]:
Sales['Values'].mean()

4.4

In [94]:
Sales['Values'].median()

5.0

In [96]:
Sales['Values'].std()

3.1304951684997055

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [2]:
Market = pd.DataFrame({
    'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06','2023-01-07','2023-01-08','2023-01-09','2023-01-10'],
    'Sales':[23,14,33,12,21,44,16,25,32,17]
})

In [3]:
Market

         Date  Sales
0  2023-01-01     23
1  2023-01-02     14
2  2023-01-03     33
3  2023-01-04     12
4  2023-01-05     21
5  2023-01-06     44
6  2023-01-07     16
7  2023-01-08     25
8  2023-01-09     32
9  2023-01-10     17

In [4]:
Market['Weekly_sales'] = Market['Sales'].rolling(window=7).mean()

In [5]:
Market

         Date  Sales  Weekly_sales
0  2023-01-01     23           NaN
1  2023-01-02     14           NaN
2  2023-01-03     33           NaN
3  2023-01-04     12           NaN
4  2023-01-05     21           NaN
5  2023-01-06     44           NaN
6  2023-01-07     16     23.285714
7  2023-01-08     25     23.571429
8  2023-01-09     32     26.142857
9  2023-01-10     17     23.857143

Here, first 6 data in weekly_sales column are marked as Nan because we have set window size as 7.

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [41]:
Calendar = pd.DataFrame({
    'Dates':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06','2023-01-07','2023-01-08','2023-01-09','2023-01-10']})

In [42]:
Calendar

        Dates
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10

In [43]:
import datetime as dt

In [44]:
Calendar = pd.to_datetime(Calendar['Dates'])

In [45]:
Calendar

0   2023-01-01
1   2023-01-02
2   2023-01-03
3   2023-01-04
4   2023-01-05
5   2023-01-06
6   2023-01-07
7   2023-01-08
8   2023-01-09
9   2023-01-10
Name: Dates, dtype: datetime64[ns]

In [46]:
def weekday(Calendar,date_column='Date',week_column='Weekday'):
    Calendar[week_column] = Calendar[date_column].dt.weekday_name
    return Calendar

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [52]:
show_dates = pd.date_range(start='2024-01-01', end='2024-03-02')

In [58]:
Monthly_report = pd.DataFrame(show_dates,columns=['Date'])

In [59]:
Monthly_report.head()

        Date
0 2024-01-01
1 2024-01-02
2 2024-01-03
3 2024-01-04
4 2024-01-05

In [73]:
def date_range(df, start_date='2023-01-01', end_date='2023-01-31', date_column_name='Date'):

    df[date_column_name] = pd.to_datetime(df[date_column_name])
    filter_rows = df[(df[date_column_name] >= start_date) & (df[date_column_name] <= end_date)]
    return filter_rows

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

import pandas as pd